Autodesk.Revit.DB.BIMBoundingBoxRepresentation
The allowed values for handling bounding box representations on import.

Autodesk.Revit.DB.BIMBoundingBoxRepresentation.WhenLackingBody
Import the bounding box representation only when there is no body representation.

Autodesk.Revit.DB.BIMBoundingBoxRepresentation.Never
Never import the bounding box representation.

Autodesk.Revit.DB.BIMBoundingBoxRepresentation.Always
Always import the bounding box representation.